{
  "_num_labels": 24,
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "decoder_start_token_id": null,
  "directionality": "bidi",
  "do_sample": false,
  "early_stopping": false,
  "eos_token_id": null,
  "finetuning_task": "naver-ner",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "UNK",
    "1": "O",
    "10": "DAT-B",
    "11": "DAT-I",
    "12": "TIM-B",
    "13": "TIM-I",
    "14": "DUR-B",
    "15": "DUR-I",
    "16": "MNY-B",
    "17": "MNY-I",
    "18": "PNT-B",
    "19": "PNT-I",
    "2": "PER-B",
    "20": "NOH-B",
    "21": "NOH-I",
    "22": "FOOD-B",
    "23": "FOOD-I",
    "3": "PER-I",
    "4": "LOC-B",
    "5": "LOC-I",
    "6": "ORG-B",
    "7": "ORG-I",
    "8": "POH-B",
    "9": "POH-I"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "is_encoder_decoder": false,
  "label2id": {
    "DAT-B": 10,
    "DAT-I": 11,
    "DUR-B": 14,
    "DUR-I": 15,
    "FOOD-B": 22,
    "FOOD-I": 23,
    "LOC-B": 4,
    "LOC-I": 5,
    "MNY-B": 16,
    "MNY-I": 17,
    "NOH-B": 20,
    "NOH-I": 21,
    "O": 1,
    "ORG-B": 6,
    "ORG-I": 7,
    "PER-B": 2,
    "PER-I": 3,
    "PNT-B": 18,
    "PNT-I": 19,
    "POH-B": 8,
    "POH-I": 9,
    "TIM-B": 12,
    "TIM-I": 13,
    "UNK": 0
  },
  "layer_norm_eps": 1e-12,
  "length_penalty": 1.0,
  "max_length": 20,
  "max_position_embeddings": 512,
  "min_length": 0,
  "model_type": "bert",
  "no_repeat_ngram_size": 0,
  "num_attention_heads": 12,
  "num_beams": 1,
  "num_hidden_layers": 12,
  "num_return_sequences": 1,
  "output_attentions": false,
  "output_hidden_states": false,
  "output_past": true,
  "pad_token_id": 0,
  "pooler_fc_size": 768,
  "pooler_num_attention_heads": 12,
  "pooler_num_fc_layers": 3,
  "pooler_size_per_head": 128,
  "pooler_type": "first_token_transform",
  "prefix": null,
  "pruned_heads": {},
  "repetition_penalty": 1.0,
  "task_specific_params": null,
  "temperature": 1.0,
  "top_k": 50,
  "top_p": 1.0,
  "torchscript": false,
  "type_vocab_size": 2,
  "use_bfloat16": false,
  "vocab_size": 54000
}
